src/DataProcessors/Браузер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Браузер</Name>
			<Comment>Web-Браузер</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдреснаяСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HTMLТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Браузер/Forms/ФормаВебБраузера/module.bsl
перем Избранное;

Процедура АдреснаяСтрокаПриИзменении(Элемент)
	
	ЭлементыФормы.ПолеHTML.Перейти(АдреснаяСтрока);	
	
КонецПроцедуры


Процедура ОткрытьДомашнююСтраницу()
	
	ЭлементыФормы.ПолеHTML.Перейти("http://www.softbalance.ru");	

КонецПроцедуры

Процедура ПолеHTMLДокумента1ДокументСформирован(Элемент)
	
	Попытка
		АдреснаяСтрока = Элемент.Документ.url;
		Если Элемент.Документ.title = "" Тогда
			//Заголовок = Элемент.Документ.url + " - WEB-Браузер";
			Заголовок = Элемент.Документ.url;
		Иначе
			//Заголовок = Элемент.Документ.title + " - WEB-Браузер";
			Заголовок = Элемент.Документ.title;
		КонецЕсли;
	Исключение
		Заголовок = "WEB-Браузер";
	КонецПопытки;

КонецПроцедуры

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Заголовок = "WEB-Браузер";
	Если не СокрЛП(АдреснаяСтрока) = "" Тогда
		ЭлементыФормы.ПолеHTML.Перейти(АдреснаяСтрока);
	КонецЕсли;
	
	Избранное = Новый СписокЗначений;
	Избранное = ВосстановитьЗначение("ИзбранноеГлобЗначение");
	Если (не Избранное = Неопределено) и Избранное.Количество()>0 Тогда 
		ДобавитьВИзбранноеИзГлобальнойПеременной();
	Иначе 
		Избранное = Новый СписокЗначений;
	КонецЕсли;
		
КонецПроцедуры

Процедура КоманднаяПанель2ДобавитьВИзбранное(Кнопка)
	
	Для каждого элемент из ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки Цикл
		Если (элемент.Текст = ("''" + Заголовок + "'' - " + АдреснаяСтрока)) Тогда
			Сообщить("Элемент уже был добавлен...");
			Возврат;
		КонецЕсли;
	КонецЦикла;
		
	Если не сокрЛП(АдреснаяСтрока) = "" и не СокрЛП(АдреснаяСтрока) = "about:blank" Тогда
		Действие = Новый Действие("ОткрытьИзбранное");
		ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки.Добавить(АдреснаяСтрока,ТипКнопкиКоманднойПанели.Действие,"''" + Заголовок + "'' - " + АдреснаяСтрока, Действие);
		Избранное.Добавить(АдреснаяСтрока,"''" + Заголовок + "'' - " + АдреснаяСтрока);
	КонецЕсли;

КонецПроцедуры

Процедура КоманднаяПанель2УдалитьИзИзбранного(Кнопка)
	
	//кнопка = ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки.Найти(АдреснаяСтрока);
	//Если не кнопка = Неопределено Тогда
	//	ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки.Удалить(кнопка);
	//	ЭлементИзбранного = Избранное.НайтиПоЗначению(АдреснаяСтрока);
	//	Избранное.Удалить(ЭлементИзбранного);
	//КонецЕсли;
	ФормаИзбранного = ПолучитьФорму("Избранное");
	ФормаИзбранного.ТабличноеПоле = Избранное;
	Избранное = ФормаИзбранного.ОткрытьМодально();
	
	Индекс = 0;
	Для каждого элемент из ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки Цикл
		Если (Индекс < 3) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		Иначе 
			ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	Попытка
		ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки.Удалить(Индекс);
	Исключение
	КонецПопытки;

	ДобавитьВИзбранноеИзГлобальнойПеременной();
		
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СохранитьЗначение("ИзбранноеГлобЗначение",Избранное);
	
КонецПроцедуры

Процедура ДобавитьВИзбранноеИзГлобальнойПеременной()
	
	Для каждого строка из Избранное Цикл
		Действие = Новый Действие("ОткрытьИзбранное");
		ЭлементыФормы.КоманднаяПанель2.Кнопки.Избранное.Кнопки.Добавить(строка.Значение,ТипКнопкиКоманднойПанели.Действие,строка.Представление, Действие);
	КонецЦикла;
	
КонецПроцедуры
    
Процедура ОткрытьИзбранное(Кнопка)
	
	ЭлементыФормы.ПолеHTML.Перейти(Кнопка.Имя);
	
КонецПроцедуры

Процедура ПриОткрытии()
    
    Если ЗначениеЗаполнено(АдреснаяСтрока) Тогда
        ЭлементыФормы.ПолеHTML.Перейти(АдреснаяСтрока);	
		
    ИначеЕсли ЗначениеЗаполнено(HTMLТекст) Тогда
        ЭлементыФормы.ПолеHTML.УстановитьТекст(HTMLТекст);	
		
    КонецЕсли;

КонецПроцедуры
